Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: For example, the Direction type defines an option set for the four directions you can move in a game.
ja: 例えば、Direction型はオプションセットをあるゲームにおいてあなたが動かせる４つの方向のために定義します。

source: For example, the removeSubrange(_:) method is implemented by calling replaceSubrange(_:with:) with an empty collection for the newElements parameter.
ja: 例えば、removeSubrange(_:)メソッドは、replaceSubrange(_:with:)をnewElementsパラメータに対して空のコレクションで呼び出すことによって実装されます。

source: For example, the following conversions result in nil:
ja: 例えば、次の変換はnilという結果になります：

source: For example, the integer value 1050 can be represented in its entirety as the string “1050”.
ja: 例えば、整数値1050はそっくりそのまま文字列「1050」として表されることができます。

source: For example, the number -8 has three trailing zeros.
ja: 例えば、数-8は後に続くゼロを３つ持ちます。

source: For example, the output formatting for a JSONEncoder instance can be sorted and can use ample white space at the same time, so it's valid to specify both options in an option set: [.sorted, .prettyPrinted].
ja: 例えば、JSONEncoderインスタンスに対する出力書式設定は、ソート可能です、そして同時に豊富な空白を使用可能です、それでそれは両方のオプションをあるオプションセットにおいて指定することは有効です：[.sorted, .prettyPrinted]。

source: For example, the result of the failable Int initializer is unconditionally unwrapped in the example below.
ja: 例えば、この失敗できるIntイニシャライザの結果は、下の例において無条件にアンラップされます。

source: For example, the size of a Double instance is MemoryLayout<Double>.size.
ja: 例えば、Doubleインスタンスのサイズは、MemoryLayout<Double>.sizeです。

source: For example, this Weekday enumeration provides static methods that return a random day of the week:
ja: 例えば、このWeekday列挙は、無作為な曜日を返す静的メソッドを提供します：

source: For example, to display the last twenty children of a mirror if they can be accessed efficiently, you write the following code:
ja: 例えば、あるミラーの最後の20個の子を表示するにはそれらが効率的にアクセスされるならば、あなたは以下のコードを書きます：

source: For example, to get the reversed version of a string, reverse its characters and initialize a new String instance from the result.
ja: 例えば、ある文字列の逆版を得るには、それの文字を逆にして、新しいStringインスタンスをその結果から初期化してください。

source: For example, to specify a nonnullable pointer to a nullable object reference, use _Nullable id * _Nonnull.
ja: 例えば、ヌル可能性オブジェクト参照への非ヌル可能性ポインタを指定するには、_Nullable id * _Nonnullを使ってください。

source: For example, using a PartialRangeFrom range expression with an array accesses the subrange from the start of the range expression until the end of the array.
ja: 例えば、PartialRangeFrom範囲式をある配列で使うことは、その下位範囲に範囲式の始まりから配列の終わりまでにアクセスします。

source: For example, using the negation operator (prefix -) with Int.min results in a runtime error.
ja: 例えば、否定演算子（-）をInt.minと使うことは、実行時エラーという結果になります。

source: For example, when converting a 16-bit value to an 8-bit type, only the lower 8 bits of source are used.
ja: 例えば、16bit値を8bit型へ変換する場合、sourceの最も下位の8ビットが使われます。

source: For example, when you pass an instance to the dump(_:_:_:_:) function, a mirror is used to render that instance’s runtime contents.
ja: 例えば、あなたがあるインスタンスをdump(_:_:_:_:)関数に渡す場合、あるミラーがそのインスタンスのもつ実行時の内容を描画するために使われます。

source: For example, you can add elements to an array of strings by calling any of the inserting or appending operations that the RangeReplaceableCollection protocol defines.
ja: 例えば、あなたはいくつかの要素をある配列に加えることが、RangeReplaceableCollectionプロトコルが定義する何らかの挿入または追加を行う演算を呼び出すことによって可能です。

source: For example, you can concatenate the elements of a Range<Int> instance and an integer array.
ja: 例えば、あなたはあるRange<Int>インスタンスとある整数配列とに属する要素を連結することができます。

source: For example, you can concatenate the elements of an integer array and a Range<Int> instance.
ja: 例えば、あなたはある整数配列とあるRange<Int>インスタンスとに属する要素を連結することができます。

source: For example, you can concatenate the elements of two integer arrays.
ja: 例えば、あなたは２つの整数配列に属する要素を連結することができます。

source: For example, you can double the elements of an array of doubles or a range of integers:
ja: 例えば、あなたはdoubleのある配列または整数のある範囲の要素を倍にできます。

source: For example, you can efficiently test a set for membership of an element or check its intersection with another set:
ja: 例えば、あなたはある要素の帰属について能率的にテストすること、またはそれの別の集合との交差を調べることができます。

source: For example, you can replace an element of an array by using its subscript.
ja: 例えば、あなたは配列の中のある要素をそれの添え字を使うことによって置き換えることができます。

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled() method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled()メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled(using:) method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled(using:)メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can sort part of a mutable collection by calling the mutable sort() method on a subscripted subsequence.
ja: 例えば、あなたはある可変コレクションの一部分をソートすることが可変sort()メソッドを添え字で指定した下位シーケンス上で行えます。

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しいかどうかを試験できます。

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is not equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しくないかどうかを試験できます。

source: For example, you can use the shuffle(using:) method to randomly reorder the elements of an array.
ja: 例えば、あなたはshuffle(using:)メソッドを使って、配列の要素を無作為に再配列することができます。

source: For example, you can use this method on an array of integers to filter adjacent equal entries or count frequencies.
ja: 例えば、あなたはこのメソッドを整数からなる配列で使うことで、隣接する同等の項目をフィルタしたり頻度を数えたりできます。

source: For example, you can use this method on an array of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値いくつかからなる配列で使うことで、それらの和または積を見つけます。

source: For example, you could create an IntPairs structure that holds a list of two-integer tuples and use an initializer that accepts a KeyValuePairs instance.
ja: 例えば、あなたはIntPairs構造体を作成することができます、それは２整数のタプルのリストを保持して、KeyValuePairsインスタンスを受け入れるイニシャライザを使います。

source: For example, you create an empty Set instance with either this initializer or with an empty array literal.
ja: 例えば、あなたは空のSetインスタンスを、このイニシャライザでまたは空の配列リテラルでのどちらかで作成します。

source: For example, you may need to serialize the result or pass it as a value to another part of your app that handles the result data.
ja: 例えば、あなたは結果をシリアライズするまたはそれをある値としてあなたのアプリの別の部分に、結果データを処理するものに渡す必要があるかもしれません。

source: For example, you may run a series of randomness tests and compute the statistical average of both a range of numbers returned from a random number generator, as well as the failure rate of calling the API.
ja: 例えば、あなたは一連の無作為性テストを走らせて、無作為数生成子から返されたある範囲の数、それだけでなくそのAPI呼び出しの失敗割合の両方の統計上の平均を計算するかもしれません。

source: For example, you might replace an Objective-C constant with a Swift constant that's nested inside a containing Swift type.
ja: 例えば、あなたはObjective-C定数を、含んでいるSwift型の内部に入れ子にされるSwift定数と置き換えるかもしれません。

source: For example, you might typically use a for-in loop to print each of the elements in an array.
ja: 例えば、あなたは概してfor-inループを使って、ある配列の中の各要素を出力するかもしれません。

source: For example:
ja: 例えば：

source: For instances of NSSet that are already immutable, copy(with:) returns the same set in constant time; otherwise, the copying performance is unspecified.
ja: 元から不変であるNSSetのインスタンスに対しては、copy(with:)は同じ集合を定数時間で返します；そうでなければ、コピーすることの性能は不定です。

source: For integer types, any remainder of the division is discarded.
ja: 整数型に対して、除算の余りは何であれ破棄されます。

source: For more about arithmetic with overflow operators, see Overflow Operators in The Swift Programming Language.
ja: オーバーフロー演算子を使う算術についてさらには、オーバーフロー演算子をSwiftプログラミング言語で見てください。

source: For more information about list format styles, see ListFormatStyle.
ja: リスト書式形式についてのさらなる情報として、ListFormatStyleを見てください。

source: For more information, see Objective-C and C Code Customization.
ja: 詳細は、Objective-CとCコードのカスタム化を見てください。

source: For most purposes, the ManagedBuffer class works fine for this purpose, and can simply be used on its own.
ja: ほとんどの用途に対して、ManagedBufferクラスはこの目的のためにすぐれて機能します、そして簡単に単独で使われることができます。

source: For operations that require adding or removing elements, see the RangeReplaceableCollection protocol instead.
ja: 要素の追加や削除を要求する演算に対しては、RangeReplaceableCollectionプロトコルを代わりに見てください。

source: For ordinary sets, an element equal to member if member is contained in the set; otherwise, nil.
ja: 普通の集合に対して、memberが集合に含まれているならば、memberに等しい要素；そうでなければ、nil。

source: For ordinary sets, an element equal to newMember if the set already contained such a member; otherwise, nil.
ja: 普通の集合に対して、集合がすでにそのようなメンバを含んでいるならば、newMemberに等しい要素；そうでなければ、nil。

source: For other collections the counters may be out of range or of the wrong type to use as an index.
ja: 他のコレクションに対してこれらのカウンタは、インデックスとして使うのには範囲外または間違った型になるでしょう。

source: For sets where the set type and element type are the same, like OptionSet types, this method returns any intersection between the set and [member], or nil if the intersection is empty.
ja: OptionSet型など、集合型と要素型が同じであるところの集合に対して、このメソッドは集合と[member]の間の何らかの交叉、または交叉が空ならばnilを返します。

source: For sets where the set type and element type are the same, like OptionSet types, this method returns any intersection between the set and [newMember], or nil if the intersection is empty.
ja: OptionSet型など、集合型と要素型が同じであるところの集合に対して、このメソッドは集合と[newMember]の間の何らかの交叉、または交叉が空ならばnilを返します。

source: For signed integer types, this value is (2 ** (bitWidth - 1)) - 1, where ** is exponentiation.
ja: 符号付き整数型に対して、この値は(2 ** (bitWidth - 1)) - 1です、そこで**は冪演算です。

source: For signed integer types, this value is -(2 ** (bitWidth - 1)), where ** is exponentiation.
ja: 符号付き整数型に対して、この値は-(2 ** (bitWidth - 1))です、そこで**は冪演算です。

source: For the ShippingOptions declaration, see the OptionSet protocol discussion.
ja: ShippingOptions宣言については、OptionSetプロトコル解説を見てください。

source: For the inherited methods to work properly, conforming types must meet the following axioms.
ja: 継承されたメソッドを適切に働かせるためには、準拠する型は以下の原則に応じる必要があります。

source: For two integers a and b, a is a multiple of b if there exists a third integer q such that a = q*b.
ja: ２つの整数aとbに対して、aはbの倍数です、もし第３の整数qが存在して、a = q*bであるようなところでは。

source: For two values x and y, and a distance n = x.distance(to: y), x.advanced(by: n) == y.
ja: ２つの値xとy、そして隔たりn = x.distance(to: y)に対して、x.advanced(by: n) == y。

source: For your type to automatically receive default implementations for set-related operations, the rawValue property must be of a type that conforms to the FixedWidthInteger protocol, such as Int or UInt8.
ja: あなたの型が自動的に省略時の実装をセット関連の演算に対して受け取るようにするには、rawValueプロパティは、FixedWidthIntegerプロトコルに準拠する型の１つでなければなりません、例えばIntまたはUInt8など。

source: Formatting a Sequence
ja: シーケンスを書式設定する

source: Foundation
ja: ファウンデーション

source: Framework
ja: フレームワーク

source: From Protocol
ja: 由来プロトコル

source: Generates a default mirror for all ancestor classes.
ja: 全ての先祖クラスに対して省略時のミラーを生成します。

source: Generates a locale-aware string representation of a sequence using the default list format style.
ja: あるシーケンスのロケールを意識した文字列表現を省略時のリスト書式形式を使って生成します。

source: Generates a locale-aware string representation of a sequence using the provided list format style.
ja: あるシーケンスのロケールを意識した文字列表現をこの提供されたリスト書式形式を使って生成します。

source: Generating Random Binary Data
ja: 無作為なバイナリデータを生成する

source: Generic Instance Method
ja: 総称体インスタンスメソッド

source: Generic Type Alias
ja: 総称体型エイリアス

source: Getting a dictionary’s value using a key returns an optional value, so imagePaths["star"] has type Optional<String> or, written in the preferred manner, String?.
ja: 辞書の持つ値をあるキーを使って取得することはあるオプショナル値を返します、それでimagePaths["star"]は型Optional<String>または、より好ましい流儀で書かれて、String?を持ちます。

source: Given a sequence of rectangular regions and associated colors, fills those regions in the current graphics context with the context’s fill color.
ja: 矩形領域それらと関連色それらからなるあるシーケンスを与えられて、それらの領域を現在のグラフィクス文脈の中でその文脈のもつ塗りつぶし色で塗りつぶします。

source: Given a sequence of rectangular regions and associated colors, fills those regions in the current graphics context.
ja: 矩形領域それらと関連色それらからなるあるシーケンスを与えられて、それらの領域を現在のグラフィクス文脈の中で塗りつぶします。

source: Given a sequence of rectangular regions and gray component values, fills those regions in the current graphics context.
ja: 矩形領域それらとグレー成分値それらからなるあるシーケンスを与えられて、それらの領域を現在のグラフィクス文脈の中で塗りつぶします。

source: Given a sequence of rectangular regions, modifies the current graphics context clipping path by intersecting it with the union of these rectangles.
ja: 矩形領域それらからなるあるシーケンスを与えられて、現在のグラフィクス文脈クリッピングパスを、それをそれら矩形の合併と交差させることによって修正します。

source: Grouping Related Objective-C Constants
ja: 関連するObjective-C定数をグループにする

source: Handling Dynamically Typed Methods and Objects in Swift
ja: 動的に型付メソッドとオブジェクトをSwiftにおいて取り扱う

source: Hash values are not guaranteed to be equal across different executions of your program.
ja: ハッシュ値は、あなたのプログラムの異なる実行をまたいで等しいことを保証されません。

source: Hashes the elements of the vector using the given hasher.
ja: ベクターの要素をこの与えられたハーシャーを使ってハッシュ化します。

source: Hashes the essential components of this value by feeding them into the given hasher.
ja: この値の本質的な構成要素を、それらをその与えられたhasherへと与えることによって、ハッシュ化します。

source: Here a default path is supplied for an image that is missing from imagePaths.
ja: ここで省略時のパスは、imagePathsから見つからない画像に対して提供されます。

source: Here's how Swift imports the related functions above into a single type:
ja: ここに、Swiftが上での関連した関数をある単一の型へとインポートする方法があります：

source: Here's how the TrafficLightColor type is imported to Swift:
ja: ここに、TrafficLightColor型がSwiftへとインポートされる方法があります：

source: Here's how the UIViewAutoresizing type is imported to Swift:
ja: ここに、UIViewAutoresizing型がSwiftへとインポートされる方法があります：

source: Here, a set of strings is created from an array literal holding only strings.
ja: ここでは、文字列の集合が文字列のみを保持する配列リテラルから作成されます。

source: Here, a set of strings is created from an array literal holding only strings:
ja: ここでは、文字列の集合が文字列のみを保持する配列リテラルから作成されます：

source: Here, three elements in the middle of an array of integers are replaced by the five elements of a Repeated<Int> instance.
ja: ここでは、整数からなるある配列の真ん中の３つの要素がRepeated<Int>インスタンスの５つの要素によって置き換えられます。

source: Here’s a definition of a Countdown sequence that serves as its own iterator.
ja: ここにCountdownシーケンスの定義があります、それはそれ自身イテレータとしての務めを果たします。

source: Here’s an example of creating an array initialized with five strings containing the letter Z.
ja: ここに、字Zを含んでいる５つの文字列で初期化される配列を作成する例があります。

source: Here’s an example of inserting a range of integers into an array of the same type:
ja: ここに整数の範囲を同じ型の配列へ挿入する例があります：

source: Here’s an example of sorting a list of students’ names.
ja: ここに、生徒名のリストをソートする例があります。

source: Here’s an example that finds a student name that begins with the letter “A”:
ja: ここに、文字「A」で始まる生徒名を見つける例があります：

source: Here’s an example that sorts the first half of an array of integers:
ja: ここにある例があります、それは整数からなるある配列の前半分をソートします：

source: Here’s an implementation of the reduce1(_:) method.
ja: ここにreduce1(_:)メソッドの実装があります。

source: Here’s how to find the longest string in a sequence, using the animals array introduced earlier as an example:
ja: ここに最も長い文字列をあるシーケンスの中で見つける方法があります、前に導入されたanimals配列を例として使っています：

source: However, if you pass 19 as rhs, the method first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして渡すならば、このメソッドは最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 19 as rhs, the operation first bitmasks rhs to 3, and then uses that masked value as the number of bits to shift lhs.
ja: しかしながら、あなたが19をrhsとして使うならば、この演算は最初にrhsを3にビットマスクして、それからそのマスクされた値をビット数として使うことでlhsをシフトします。

source: However, if you use 8 as the shift amount, the method first masks the shift amount to zero, and then performs the shift, resulting in no change to the original value.
ja: しかしながら、あなたが8をシフト量として使うならば、メソッドは最初にそのシフト量をマスクしてゼロにして、それからシフトを実行して、元の値に対して変更しないという結果になります。

source: However, in cases where objects of various different classes must serve as storage, ManagedBufferPointer is needed.
ja: しかしながら、種々の異なるクラスのオブジェクトがストレージとして供されなければならない場合には、ManagedBufferPointerが必要とされます。

source: However, in optimized builds (-O), no check is performed to ensure that the current instance actually has a value.
ja: しかしながら、最適化ビルド（-O）において、現在のインスタンスが実際に値を持つか確かめる確認は全く実行されません。

source: However, in order to meet the complexity guarantees of a random-access collection, either the index for your custom type must conform to the Strideable protocol or you must implement the index(_:offsetBy:) and distance(from:to:) methods with O(1) efficiency.
ja: しかしながら、無作為アクセスコレクションの計算量（複雑さ）保証を達成する手段として、あなたのあつらえの型に対するインデックスがStrideableプロトコルに準拠する、またはあなたがindex(_:offsetBy:)とdistance(from:to:)メソッドをO(1)の効率で実装する、いずれかをしなければなりません。

source: However, you can’t use the throws keyword to model APIs that return asynchronously.
ja: しかしながら、あなたはthrowsキーワードを使うことで、非同期に返るAPIをこしらえることはできません。

source: Identical to self.
ja: selfと同一。

source: Identify a Throwing Expression to Preserve
ja: スローする式を識別することで保全する

source: If areEquivalent(a, b) and areEquivalent(b, c) are both true, then areEquivalent(a, c) is also true.
ja: areEquivalent(a, b)とareEquivalent(b, c)が両方ともtrueならば、そのときareEquivalent(a, c)もまたtrueである。

source: If areInIncreasingOrder(a, b) and areInIncreasingOrder(b, c) are both true, then areInIncreasingOrder(a, c) is also true.
ja: areInIncreasingOrder(a, b)とareInIncreasingOrder(b, c)が両方ともtrueならば、そのときareInIncreasingOrder(a, c)もまたtrueである。

source: If description is in an invalid format, or if the value it denotes in base 10 is not representable, the result is nil.
ja: descriptionが無効な形式になっているならば、またはそれが底10で示す値が表現可能でないならば、結果はnilです。

source: If distance > 0, limit should be greater than i to have any effect.
ja: distance > 0ならば、limitが何らかの効果を持つにはiより大きくなければなりません。

source: If distance > 0, a limit that is less than i has no effect.
ja: distance > 0ならば、iより少ない限度は効果を持ちません。

source: If end is equal to start, the result is zero.
ja: endがstartに等しいならば、結果はゼロです。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the collection and for each instance of separator at the start or end of the collection.
ja: falseならば、このコレクション中の連続するseparator要素の対それぞれに、そしてコレクションの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the sequence and for each instance of separator at the start or end of the sequence.
ja: falseならば、このシーケンス中の連続するseparator要素の対それぞれに、そしてシーケンスの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the collection satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすコレクションの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the sequence satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすシーケンスの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original collection containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元コレクションの後ろ部分です。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original sequence containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元シーケンスの後ろ部分です。

source: If newMember is not contained in the set but subsumes current members of the set, the subsumed members are returned.
ja: newMemberがこの集合の中に含まれないしかしこの集合の現在の要素を包含するならば、包含されたメンバが返されます。

source: If predicate matches every element in the sequence, the result is an empty sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果は空のシーケンスです。

source: If predicate matches every element in the sequence, the resulting sequence contains every element of the sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果のシーケンスはそのシーケンスのすべての要素を含みます。

source: If result is Result.success(_:), then the publisher waits until it receives a request for at least one value, then sends the output to all subscribers and finishes normally.
ja: resultがResult.success(_:)であるならば、そのときパブリッシャーは、それがリクエストを少なくとも１つの値に対して受け取るまで待機します、それから出力を全ての加入者へと送信します。

source: If source is outside the bounds of this type after rounding toward zero, a runtime error may occur.
ja: sourceがゼロへの丸め後にこの型の境界の外側ならば、実行時エラーが起こるかもしれません。

source: If subject is a class instance, ancestorRepresentation determines whether ancestor classes will be represented and whether their customMirror implementations will be used.
ja: subjectがクラスインスタンスであるならば、ancestorRepresentationは、先祖クラスが表現されるかどうかをそしてcustomMirror実装が使われるかどうかを決定します。

source: If text is in an invalid format or contains characters that are out of bounds for the given radix, or if the value it denotes in the given radix is not representable, the result is nil.
ja: text が無効な形式になっているか指定radixの領域外の文字列を含むならば、または指定radixにおいてそれが意味する値が表現可能でないならば、結果はnilです。

source: If true, the set’s buffer capacity is preserved; if false, the underlying buffer is released.
ja: trueならば、集合が持つバッファ容量を維持します；falseならば基盤をなすバッファは解放されます。

source: If a and b are incomparable, and b and c are incomparable, then a and c are also incomparable.
ja: aとbが比較できないならば、そしてbとcが比較できないならば、そのときaとcもまた比較できない。

source: If element is not found in the collection, returns nil.
ja: elementがコレクションの中に見つけられないならば、nilを返します。

source: If element is not found in the collection, this method returns nil.
ja: elementがコレクションの中に見つけられないならば、このメソッドはnilを返します。

source: If other contains multiple instances of equivalent elements, only the first instance is kept.
ja: otherが同等の要素を複数含むならば、最初の要素だけが残されます。

source: If rhs is outside the range 0...bitWidth, it is masked to produce a value within that range.
ja: rhsが範囲0...bitWidthの外側ならば、それはマスクされてその範囲内の値を生み出します。

source: If areInIncreasingOrder throws an error during the sort, the elements may be in a different order, but none will be lost.
ja: areInIncreasingOrderがエラーをソートの間にスローするならば、要素は異なる順番になるかもしれません、しかし何１つとしてなくさないでしょう。

source: If distance is positive, this is the same value as the result of distance calls to index(after:).
ja: distanceが正ならば、これはdistanceでindex(after:)を呼び出す結果と同じ値です。

source: If i == endIndex, this method is equivalent to append(_:).
ja: i == endIndexならば、このメソッドはappend(_:)に相当します。

source: If source is less than the smallest representable value in this type, the result is the type’s min value.
ja: sourceがこの型の最も小さい表現可能な値より小さいならば、結果はこの型のもつmin値です。

source: If true, only nonempty subsequences are returned.
ja: trueならば、空でない下位シーケンスだけが返されます。

source: If possiblePrefix has no elements, the return value is true.
ja: possiblePrefixが１つも要素を持たないならば、戻り値はtrueです。

source: If result is Result.failure(_:), then the publisher sends the failure immediately upon subscription.
ja: resultがResult.failure(_:)であるならば、そのときパブリッシャーは、不成功を直ぐに定期購買上で送信します。

source: If distance is negative, this is the same value as the result of abs(distance) calls to index(before:).
ja: distanceが負ならば、これはabs(distance)でindex(before:)を呼び出す結果と同じ値です。

source: If i == endIndex, this method is equivalent to append(contentsOf:).
ja: i == endIndexならば、このメソッドはappend(contentsOf:)に相当します。

source: If a future change to the app requires an additional state, you need to update an additional variable at every existing change in state.
ja: アプリに対する将来の変更が追加の状態を要求するならば、あなたは、状態において起こっているすべての変化で、追加の変数を更新する必要があります。

source: If a property is converted from a stored property to a computed property, the result of offset(of:) changes to nil.
ja: プロパティが格納プロパティから計算プロパティに変換されるならば、offset(of:)の結果はnilに変わります。
